In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ['Felix','Hud','Abiral']
my_list = [1,4,5]
arr = np.array([1,4,5])
d = {'Felix':1,'Hud':4,'Abiral':5}

In [3]:
pd.Series(data=my_list)

0    1
1    4
2    5
dtype: int64

In [4]:
print("Familarity With Python")
pd.Series(data=my_list,index=labels)

Familarity With Python

Felix     1
Hud       4
Abiral    5
dtype: int64

In [5]:
pd.Series(data = arr)

0    1
1    4
2    5
dtype: int32

In [6]:
pd.Series(arr,labels)

Felix     1
Hud       4
Abiral    5
dtype: int32

In [7]:
ser = pd.Series(d)
ser

Felix     1
Hud       4
Abiral    5
dtype: int64

In [8]:
pd.Series(data=labels)

0     Felix
1       Hud
2    Abiral
dtype: object

In [9]:
ser['Hud']

4

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])        
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])     
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [13]:
ser1.add(ser2)

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [14]:
df = pd.DataFrame(randn(5,4),index=('A', 'B' ,'C','D','E'),columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A -0.435096 -0.060735 -1.377433 -0.680921
B -0.685588  1.472304 -1.132112  0.529295
C -1.356979 -0.300260 -0.319857 -0.956465
D  0.564980 -2.477843 -0.302480 -0.196465
E  0.181023  0.536345 -0.424725 -1.291406

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A -0.435096 -0.060735 -1.377433 -0.680921 -1.812529
B -0.685588  1.472304 -1.132112  0.529295 -1.817700
C -1.356979 -0.300260 -0.319857 -0.956465 -1.676836
D  0.564980 -2.477843 -0.302480 -0.196465  0.262500
E  0.181023  0.536345 -0.424725 -1.291406 -0.243702

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.435096 -0.060735 -1.377433 -0.680921
B -0.685588  1.472304 -1.132112  0.529295
C -1.356979 -0.300260 -0.319857 -0.956465
D  0.564980 -2.477843 -0.302480 -0.196465
E  0.181023  0.536345 -0.424725 -1.291406

In [20]:
df

          W         X         Y         Z       new
A -0.435096 -0.060735 -1.377433 -0.680921 -1.812529
B -0.685588  1.472304 -1.132112  0.529295 -1.817700
C -1.356979 -0.300260 -0.319857 -0.956465 -1.676836
D  0.564980 -2.477843 -0.302480 -0.196465  0.262500
E  0.181023  0.536345 -0.424725 -1.291406 -0.243702

In [21]:
df.drop('new',axis=1,inplace=True)

In [22]:
df

          W         X         Y         Z
A -0.435096 -0.060735 -1.377433 -0.680921
B -0.685588  1.472304 -1.132112  0.529295
C -1.356979 -0.300260 -0.319857 -0.956465
D  0.564980 -2.477843 -0.302480 -0.196465
E  0.181023  0.536345 -0.424725 -1.291406

In [23]:
df.drop('C',axis=0)

          W         X         Y         Z
A -0.435096 -0.060735 -1.377433 -0.680921
B -0.685588  1.472304 -1.132112  0.529295
D  0.564980 -2.477843 -0.302480 -0.196465
E  0.181023  0.536345 -0.424725 -1.291406

In [24]:
df

          W         X         Y         Z
A -0.435096 -0.060735 -1.377433 -0.680921
B -0.685588  1.472304 -1.132112  0.529295
C -1.356979 -0.300260 -0.319857 -0.956465
D  0.564980 -2.477843 -0.302480 -0.196465
E  0.181023  0.536345 -0.424725 -1.291406